MODEL 7:

What it does?

Same as model 4 that shows revenue monthly for cinemas, but this one shows daily revenue for cinemas.

Business quesiton:

Which cinemas generate the most revenue on a daily basis?

Takeaway:

Surfaces top-performing cinemas by daily revenue, offering more granular insight than total revenue. This highlights performance patterns over time, helping identify consistent top performers, seasonal shifts, and anomalies.

In [1]:
import duckdb

In [2]:
conn = duckdb.connect(r'..\cinema_tickets.duckdb')
conn

MODEL 7 QUERY:

In [3]:
query = """
SELECT 
    cinema_code,
    day,
    SUM(total_revenue_usd) AS daily_revenue
FROM master_model
GROUP BY cinema_code, day
ORDER by day, daily_revenue DESC
"""

conn.execute(query).fetch_df()

      cinema_code  day  daily_revenue
0             448    1     4089629.25
1             304    1     1931785.00
2             524    1     1221362.50
3             489    1     1199952.50
4             344    1     1106455.00
...           ...  ...            ...
7401          525   31         680.00
7402          465   31         540.00
7403          512   31         450.00
7404          215   31         350.00
7405          543   31         100.00

[7406 rows x 3 columns]

After creating the table in the duckdb here im just verifying if it runs:

In [4]:
conn.execute('SELECT * FROM seventh_model').fetch_df()

       cinema_code        date  daily_revenue
0              448  2018-02-21        16015.0
1              518  2018-02-23           90.0
2               39  2018-03-14        10225.0
3               94  2018-03-14          360.0
4               62  2018-03-14          960.0
...            ...         ...            ...
44880          489  2018-11-04        33795.0
44881          185  2018-11-04         5320.0
44882          162  2018-11-04          960.0
44883          204  2018-11-04          980.0
44884           71  2018-11-04        11850.0

[44885 rows x 3 columns]

In [5]:
conn.close()